Revit 2027 API
gbXMLConditionType Enumeration
 This enumeration corresponds to the conditionType attribute in gbXML. The enumerated attribute identifies the type of heating, cooling, or ventilation the space has.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum gbXMLConditionType
Public Enumeration gbXMLConditionType
public enum class gbXMLConditionType
type gbXMLConditionType
Members
Member name | Value | Description
Cooled | 1
Heated | 0
HeatedAndCooled | 2
NaturallyVentedOnly | 5
NoConditionType | -1
NoOfConditionTypes | 6
Unconditioned | 3
Vented | 4
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace